LUKASHENKO = [110, 1, 12, 100, 60,
              "Батька",
              'А я сейчас вам покажу, откуда на беларусь готовилось нападение. И если бы за шесть часов ' \
              'до операции не был нанесён превентивный удар по позициям — четыре позиции, ' \
              'я сейчас покажу карту, привёз — они бы атаковали наши войска, беларуси и россии, ' \
              'которые были на учениях. Поэтому не мы развязали эту войну, у нас совесть чиста. Хорошо, ' \
              'что начали. Биологическое оружие, самые большие атомные электростанции — и всё это были ' \
              'готовы взорвать, ',
              "Картошечный король ушел в мир иной",
              "CAACAgIAAxkBAAEE9-ZipIhhiVdgFpBCH6satg2t_sBvlQAC4BwAArNCIEkAAeNkcEh3_KQkBA",
              ["🥔", "Шерсть"]]
